Dlubal.RFEM5.NodeType
Type of node

Dlubal.RFEM5.NodeType.UnknownNode
Unknown node

Dlubal.RFEM5.NodeType.Standard
Standard node

Dlubal.RFEM5.NodeType.NodeOnLine
Node on line

Dlubal.RFEM5.NodeType.NodeOnSurface
Node on surface

Dlubal.RFEM5.NodeType.TrajectoryNode
Trajectory node

Dlubal.RFEM5.NodeType.Parameterized
Parameterized node